erley/stm32-sdcard/sdcard/sys/BSP/stm32_sd_spi.c
/******************************************************************************
 * @file    stm32_sd_spi.c
 * @author  Alexei Troussov
 * @version V1.0
 * @date    21-June-2012
 * @brief   High-level communication layer for read/write SD Card mounted on SPI bus.
 *
+--------------------------------------------------------------+
|                     Pin assignment                           |
+-------------------------+---------------+-------------+------+
|  STM32 SPI Pins         |     SD        |    Pin      | uCos |
+-------------------------+---------------+-------------+------+
| SD_SPI_CS_PIN           |   ChipSelect  |    1        | PB11 |
| SD_SPI_MOSI_PIN / MOSI  |   DataIn      |    2        | PB15 |
|                         |   GND         |    3 (0 V)  |      |
|                         |   VDD         |    4 (3.3 V)|      |
| SD_SPI_SCK_PIN / SCLK   |   Clock       |    5        | PB13 |
|                         |   GND         |    6 (0 V)  |      |
| SD_SPI_MISO_PIN / MISO  |   DataOut     |    7        | PB14 |
+-------------------------+---------------+-------------+------+
===============================================================================================================
    | SPI                           | 1-bit SD bus                    | 4-bit SD bus
Pin	| Name    I/O   Desc            | Name    I/O     Desc            | Name    I/O      Desc
===============================================================================================================
 1  | nCS     Ipp   Card Select     | NC      -       NC              | D3      Ipp/Opp  Data 3
 2  | DI      Ipp   Data In (MOSI)  | CMD     Ipp/Ood Cmd/Reply       | CMD     Ipp/Ood  Cmd/Reply
 3  | GND     S     Ground          | GND     S       Ground          | GND     S        Ground
 4  | VDD     S     Power           | VDD     S       Power           | VDD     S        Power
 5  | CLK     Ipp   Clock (SCLK)    | CLK     Ipp     Clock           | CLK     Ipp      Clock
 6  | GND     S     Ground          | GND     S       Ground          | GND     S        Ground
 7  | DO      Opp   Data Out (MISO) | D0      Ipp/Opp Data 0          | D0      Ipp/Opp  Data 0
 8  | NC/nIRQ -/Ood NC(SD)/IRQ(SDIO)| NC/nIRQ -/Ood   NC(SD)/IRQ(SDIO)| D1/nIRQ IOpp/Ood Data 1(+IRQ for SDIO)
 9  | NC      -     -               | NC      -       -               | D2      Ipp/Opp  Data 2
===============================================================================================================
	pp - Push-pull logic
	od - Open-drain logic
===============================================================================================================
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/

#include "main.h"

#include "stm32_sd_spi.h"

#include "stm32_spi.h"
#include <stdio.h>

/** @addtogroup Utilities
 * @{
 */


/** @defgroup STM32_Private_Types
 * @{
 */

/**
 * @brief  Type of SD card
 */
typedef enum _SDCardType
{
	SD_Card_MMC,	/*!< Multimedia card (no CMD8, no ACMD41, but CMD1, uses byte-addressing) */
	SD_Card_SDSC_v1,/*!< Standard Capacity card v1 (no CMD8, but ACMD41, uses byte-addressing) */
	SD_Card_SDSC_v2,/*!< Standard Capacity card v2 (has CMD8+ACMD41, uses byte-addressing) */
	SD_Card_SDHC	/*!< High Capacity card (has CMD8+ACMD41, uses sector-addressing) */
} SDCardType;

/**
 * @brief  Data response sent for CMD24
 */
typedef enum _SD_DataResponse
{
	SD_RESPONSE_MASK          = 0x0E,	/*!< any response value bits have to be masked by this */
	SD_RESPONSE_ACCEPTED      = 0x04,	/*!< data accepted */
	SD_RESPONSE_REJECTED_CRC  = 0x0A,	/*!< data rejected due to CRC error */
	SD_RESPONSE_REJECTED_ERR  = 0x0C	/*!< data rejected due to write error */
} SD_DataResponse;

/**
 * @brief  Data response error
 */
typedef enum _SD_DataError
{
	SD_DATA_TOKEN_OK          = 0x00,
	SD_DATA_TOKEN_ERROR       = 0x01,
	SD_DATA_TOKEN_CC_ERROR    = 0x02,
	SD_DATA_TOKEN_ECC_FAILURE = 0x04,
	SD_DATA_TOKEN_OUT_OF_RANGE= 0x08,
	SD_DATA_TOKEN_CARD_LOCKED = 0x10,
} SD_DataError;

/**
 * @brief  Commands: CMDxx = CMD-number | 0x40
 */
/*
	class 0 (basic):
		CMD0		CMD2		CMD3		CMD4
		CMD7		CMD8		CMD9		CMD10
		CMD11		CMD12		CMD13		CMD15
	class 2 (block read):
		CMD16		CMD17		CMD18		CMD19		CMD20		CMD23
	class 4 (block write):
		CMD16		CMD20		CMD23		CMD24		CMD25		CMD27
	class 5 (erase):
		CMD32		CMD33		CMD38
	class 6 (write protection):
		CMD28		CMD29		CMD30
	class 7 (lock card):
		CMD16		CMD40		CMD42
	class 8 (application-specific):
		CMD55		CMD56
		ACMD6		ACMD13	ACMD22	ACMD23	ACMD41	ACMD42	ACMD51
	class 9 (I/O mode):
		CMD5		CMD52		CMD53
	class 10 (switch):
		CMD6		CMD34		CMD35		CMD36		CMD37		CMD50		CMD57
	all other classes are reserved
 */
typedef enum _SD_CMD
{
	SD_CMD_GO_IDLE_STATE		=  0, /*!< CMD0  = 0x40, ARG=0x00000000, CRC=0x95 */
	SD_CMD_SEND_OP_COND			=  1, /*!< CMD1  = 0x41 */
	SD_CMD_SEND_IF_COND			=  8, /*!< CMD8  = 0x48, ARG=0x000001AA, CRC=0x87 */
	SD_CMD_SEND_APP				= 55, /*!< CMD55 = 0x77, ARG=0x00000000, CRC=0x65 */
	SD_CMD_ACTIVATE_INIT		= 41, /*!< ACMD41= 0x69, ARG=0x40000000, CRC=0x77 */
	SD_CMD_READ_OCR				= 58, /*!< CMD58 = 0x7A, ARG=0x00000000, CRC=0xFF */
	SD_CMD_SEND_CSD				=  9, /*!< CMD9  = 0x49 */
	SD_CMD_SEND_CID				= 10, /*!< CMD10 = 0x4A */
	SD_CMD_SEND_SCR				= 51, /*!< ACMD51= 0x73 */
	SD_CMD_STATUS				= 13, /*!< ACMD13= 0x4D */
	SD_CMD_STOP_TRANSMISSION	= 12, /*!< CMD12 = 0x4C */
	SD_CMD_SET_BLOCKLEN			= 16, /*!< CMD16 = 0x50 */
	SD_CMD_READ_SINGLE_BLOCK	= 17, /*!< CMD17 = 0x51 */
	SD_CMD_READ_MULT_BLOCK		= 18, /*!< CMD18 = 0x52 */
	SD_CMD_SET_BLOCK_COUNT		= 23, /*!< CMD23 = 0x57 */
	SD_CMD_WRITE_SINGLE_BLOCK	= 24, /*!< CMD24 = 0x58 */
	SD_CMD_WRITE_MULT_BLOCK		= 25, /*!< CMD25 = 0x59 */
	SD_CMD_ERASE_BLOCK_START	= 32, /*!< CMD32 = 0x60 */
	SD_CMD_ERASE_BLOCK_END		= 33, /*!< CMD33 = 0x61 */
	SD_CMD_ERASE				= 38  /*!< CMD38 = 0x66 */
} SD_CMD;

/**
 * @}
 *//* STM32_Private_Types */


/** @defgroup STM32_Private_Defines
 * @{
 */

/**
 * @brief  Dummy byte
 */
#define SD_DUMMY_BYTE		0xFF

/**
 * @brief  Number of 8-bit cycles for RUMP UP phase
 */
#define SD_NUM_TRIES_RUMPUP	((uint32_t)2500)

/**
 * @brief  Maximum number of tries to send a command
 */
#define SD_NUM_TRIES		((uint16_t)300)

/**
 * @brief  Maximum number of tries until ACMD41/CMD1 initializes SD card
 * It means a time until "In Idle State" flag is set during initialization
 * For information:
 * ~ 11000 for Kingston 4Gb
 * ~ 10000 for SanDisk  1Gb
 * ~  6000 for Samsung  8Gb
 */
#define SD_NUM_TRIES_INIT	((uint16_t)20000)

/**
 * @brief  Maximum number of tries to receive data transmission token
 * It means a time before data transmission starts
 * For information:
 * ~  300 for SanDisk  1Gb
 * ~  600 for Kingston 4Gb
 * ~  900 for SP       4Gb
 * ~  500 for Samsung  8Gb
 * ~  300 for Lexar    4Gb
 */
#define SD_NUM_TRIES_READ	((uint16_t)2000)

/**
 * @brief  Maximum number of tries until SD card writes data
 * It means a time while BUSY flag is set, i.e. card writes the data received
 * For information:
 * ~  6100 for Kingston 4Gb
 * ~  4600 for Lexar    4Gb
 * ~ 80000 for SP       4Gb (9000)
 * ~ 10000 for SanDisk  1Gb
 * ~119000 for Samsung  8Gb
 */
#define SD_NUM_TRIES_WRITE	((uint32_t)1000000)

/**
 * @brief  Maximum number of tries until SD card erases data
 * It means a time while BUSY flag is set, i.e. card erases sectors
 * For information:
 * ~  6100 for Kingston 4Gb
 * ~  5200 for Lexar    4Gb
 * ~ 10300 for SP       4Gb
 * ~   N/A for SanDisk  1Gb
 * ~120000 for Samsung  8Gb
 */
#define SD_NUM_TRIES_ERASE	((uint32_t)1000000)

/**
 * @brief  Start Data tokens:
 *         Tokens (necessary because at nop/idle (and CS active) only 0xff is
 *         on the data/command line)
 */
#define SD_DATA_BLOCK_READ_START           0xFE  /*!< Data token start byte, Start Single/Multiple Block Read */
#define SD_DATA_SINGLE_BLOCK_WRITE_START   0xFE  /*!< Data token start byte, Start Single Block Write */
#define SD_DATA_MULTIPLE_BLOCK_WRITE_START 0xFC  /*!< Data token start byte, Start Multiple Block Write */
#define SD_DATA_MULTIPLE_BLOCK_WRITE_STOP  0xFD  /*!< Data token stop byte, Stop Multiple Block Write */

/**
 * @}
 *//* STM32_Private_Defines */

/** @defgroup STM32_Private_Macros
 * @{
 */

/**
 * @brief  Write a byte on the SD.
 * @param  Data: byte to send.
 * @retval None
 */
#define SD_WriteByte( b )	STM_EVAL_SPI_Send_Recieve_Data( (b) )

/**
 * @brief  Read a byte from the SD.
 * @param  None
 * @retval The received byte.
 */
#define SD_ReadByte()		STM_EVAL_SPI_Send_Recieve_Data( SD_DUMMY_BYTE )

/**
 * @}
 *//* STM32_Private_Macros */


/** @defgroup STM32_Private_Variables
 * @{
 */

SDCardType cardType;

/**
 * @}
 *//* STM32_Private_Variables */


/** @defgroup STM32_Private_Function_Prototypes
 * @{
 */
/**
 * @}
 *//* STM32_Private_Function_Prototypes */


