erley/stm32-sdcard/sdcard/sys/BSP/stm32_sd_spi.c
/** @defgroup STM32_Private_Functions
 * @{
 */

/**
 * @brief  Send a command to SD card and receive R1 response
 * @param  Cmd: Command to send to SD card
 * @param  Arg: Command argument
 * @param  Crc: CRC
 * @retval R1 response byte
 */
static SD_Error SD_SendCmd( uint8_t cmd, uint32_t arg, uint8_t crc )
{
	uint8_t res;
	uint16_t i = SD_NUM_TRIES;
	/* send a command */
	SD_WriteByte( (cmd & 0x3F) | 0x40 );	/*!< byte 1 */
	SD_WriteByte( (uint8_t)(arg >> 24) );	/*!< byte 2 */
	SD_WriteByte( (uint8_t)(arg >> 16) );	/*!< byte 3 */
	SD_WriteByte( (uint8_t)(arg >> 8) );	/*!< byte 4 */
	SD_WriteByte( (uint8_t)arg );			/*!< byte 5 */
	SD_WriteByte( crc | 0x01 );				/*!< byte 6: CRC */
	/* a byte received immediately after CMD12 should be discarded... */
	if ( cmd == SD_CMD_STOP_TRANSMISSION )
		SD_ReadByte();
	/* SD Card responds within Ncr (response time),
	   which is 0-8 bytes for SDSC cards, 1-8 bytes for MMC cards */
	do {
		res = SD_ReadByte();
		/* R1 response always starts with 7th bit set to 0 */
	} while ( ( res & SD_CHECK_BIT ) != 0x00 && i-- > 0);
	return (SD_Error)res;
}

/**
 * @brief  Get 4 bytes of R3 or R7 response
 * @param  pres: Pointer to uint32_t variable for result
 * @retval None
 */
static void SD_GetResponse4b( uint8_t* pres )
{
	pres[ 3 ] = SD_ReadByte();
	pres[ 2 ] = SD_ReadByte();
	pres[ 1 ] = SD_ReadByte();
	pres[ 0 ] = SD_ReadByte();
}

/**
 * @brief  Set SD Card sector size to SD_CMD_SET_BLOCKLEN (512 bytes)
 * @param  New sector size
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
static SD_Error SD_FixSectorSize( uint16_t ssize )
{
	return SD_SendCmd( SD_CMD_SET_BLOCKLEN, (uint32_t)ssize, 0xFF );
}

/**
 * @brief  Some commands take longer time and respond with R1b response,
 *         so we have to wait until 0xFF recieved (MISO is set to HIGH)
 * @retval Nonzero if required state wasn't recieved
 */
static SD_Error SD_WaitReady( void )
{
	uint16_t i = SD_NUM_TRIES;
	while ( i-- > 0 )
	{
		if ( SD_ReadByte() == 0xFF )
		{
//printf( " [[ WAIT delay %d ]] ", SD_NUM_TRIES - i );
			return SD_RESPONSE_NO_ERROR;
		}
	}
//printf( " [[ WAIT delay was not enough ]] " );
	return SD_RESPONSE_FAILURE;
}

/**
 * @brief  Wait until data transmission token is received
 * @retval Data transmission token or 0xFF if timeout occured
 */
static uint8_t SD_WaitBytesRead( void )
{
	uint16_t i = SD_NUM_TRIES_READ;
	uint8_t b;
	do {
		b = SD_ReadByte();
	} while ( b == 0xFF && i-- > 0 );

	if ( b != 0xFF )
		printf( " [[ READ delay %d ]] ", SD_NUM_TRIES_READ - i );
	else
		printf( " [[ READ delay was not enough ]] " );

	return b;
}

/**
 * @brief  Writing data into flash takes even longer time and it responds with R1b response,
 *         so we have to wait until 0xFF recieved (MISO is set to HIGH)
 * @retval Nonzero if required state wasn't recieved
 */
static SD_Error SD_WaitBytesWritten( void )
{
	uint32_t i = SD_NUM_TRIES_WRITE;
	while ( i-- > 0 )
	{
		if ( SD_ReadByte() == 0xFF )
		{
			printf( " [[ WRITE delay %lu ]] ", SD_NUM_TRIES_WRITE - i );
			return SD_RESPONSE_NO_ERROR;
		}
	}
	printf( " [[ WRITE delay was not enough ]] " );
	return SD_RESPONSE_FAILURE;
}

/**
 * @brief  Erasing data into flash takes some time and it responds with R1b response,
 *         so we have to wait until 0xFF recieved (MISO is set to HIGH)
 * @retval Nonzero if required state wasn't recieved
 */
static SD_Error SD_WaitBytesErased( void )
{
	uint32_t i = SD_NUM_TRIES_ERASE;
	while ( i-- > 0 )
	{
		if ( SD_ReadByte() == 0xFF )
		{
			printf( " [[ ERASE delay %lu ]] ", SD_NUM_TRIES_ERASE - i );
			return SD_RESPONSE_NO_ERROR;
		}
	}
	printf( " [[ ERASE delay was not enough ]] " );
	return SD_RESPONSE_FAILURE;
}

/**
 * @brief  Hold SPI bus for SD card
 * @param  None
 * @retval None
 */
static void SD_Bus_Hold( void )
{	/* Select SD Card: set SD chip select pin low */
	GPIO_ResetBits( SD_CS_GPIO_PORT, SD_CS_PIN );
}

/**
 * @brief  Release SPI bus used by SD card
 * @param  None
 * @retval None
 */
static void SD_Bus_Release( void )
{	/* Deselect SD Card: set SD chip select pin high */
	GPIO_SetBits( SD_CS_GPIO_PORT, SD_CS_PIN );
	SD_ReadByte();	/* send dummy byte: 8 Clock pulses of delay */
}

/**
 * @brief  Put SD in Idle state.
 * @param  None
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
static SD_Error SD_GoIdleState( void )
{
	uint32_t res = 0;
	uint16_t i;
	uint8_t state;

	/* --- put SD card in SPI mode */
	SD_Bus_Hold();

	i = SD_NUM_TRIES;	/* reset try count... */
	do {	/* loop until In Idle State Response (in R1 format) confirmation */
		state = SD_SendCmd( SD_CMD_GO_IDLE_STATE, 0x00000000, 0x95 ); /* valid CRC is mandatory here */
	} while ( state != SD_IN_IDLE_STATE && i-- > 0 );
	/* still no Idle State Response => return response failure */
	if ( state != SD_IN_IDLE_STATE )
		return SD_RESPONSE_FAILURE;

	/* --- SD card is now in idle state and in SPI mode, activate it and get its type */
	cardType = SD_Card_SDSC_v2;

	state = SD_WaitReady();	/* make sure card is ready before we go further... */

	/* --- try to send CMD8 to offer voltage 2.7-3.6V with check pattern 0xAA */
	i = SD_NUM_TRIES;	/* reset try count... */
	do {
		state = SD_SendCmd( SD_CMD_SEND_IF_COND, 0x000001AA, 0x87 ); /* valid CRC is mandatory here */
		if ( ( state & SD_ILLEGAL_COMMAND ) != 0 )
		{	/* SD card doesn't accept CMD8 => it's SDSC or MMC card... */
			cardType = SD_Card_SDSC_v1;
			break;
		}
		else/* SD card accepts CMD8 => it's SDHC or SDXC card... */
		{	/* get R7 response and verify pattern for sanity check... */
			SD_GetResponse4b( (uint8_t*)&res );
			if ( ( res & 0x0000FFFF ) == 0x000001AA )
				break;	/* check pattern is OK, card accepted offered voltage... */
			/* else specification recommends to retry CMD8 again */
		}
	} while ( i-- > 0 );
	if ( i == 0 )
		return SD_RESPONSE_FAILURE;	/* error occurred... */

	state = SD_WaitReady();	/* make sure card is ready before we go further... */

	/* --- activate card initialization sequence... */
	/* CMD55(0) -> ACMD41(0) -> ... */
	i = SD_NUM_TRIES_INIT;	/* reset try count... */
	do {
		state = SD_SendCmd( SD_CMD_SEND_APP, 0x00000000, 0x65 );
		if ( state != SD_IN_IDLE_STATE )
		{	/* error occurred => last chance is to try it as a legacy MMC card */
			cardType = SD_Card_MMC;
			break;
		}

		state = SD_WaitReady();	/* make sure card is ready before we go further... */

