erley/stm32-sdcard/sdcard/sys/BSP/stm32_sd_spi.c
		if ( cardType == SD_Card_SDSC_v1 )		/* HCS bit (0 here) is ignored by SDSC card */
			state = SD_SendCmd( SD_CMD_ACTIVATE_INIT, 0x00000000, 0xFF );
		else
			state = SD_SendCmd( SD_CMD_ACTIVATE_INIT, 0x40000000, 0x77 );
		/* loop while SD_IN_IDLE_STATE bit is set, meaning card is still performing initialization */
	} while ( ( state & SD_IN_IDLE_STATE ) != 0x00 && i-- > 0 );
	/* it might be legacy MMC card... */
	if ( cardType == SD_Card_SDSC_v1 &&
			( state & SD_IN_IDLE_STATE ) != 0x00 )
		cardType = SD_Card_MMC;

	state = SD_WaitReady();	/* make sure card is ready before we go further... */

	if ( cardType == SD_Card_MMC )	/* legacy MMC card is initialized with CMD1... */
	{	/* -> CMD1(0) -> ... */
		i = SD_NUM_TRIES_INIT; /* reset try count... */
		do {
			state = SD_SendCmd( SD_CMD_SEND_OP_COND, 0x00000000, 0xFF );
		} while ( ( state & SD_IN_IDLE_STATE ) != 0x00 && i-- > 0 );
		if ( i == 0 )
			return SD_RESPONSE_FAILURE;	/* error occurred... */
	}
	else if ( cardType == SD_Card_SDSC_v2 ) /* recent cards support byte-addressing, check it... */
	{	/* -> CMD58(0)... */
		if ( i == 0 )	/* first check if timeout occured during its initialization... */
			return SD_RESPONSE_FAILURE;	/* error occurred... */
		/* request OCR register (send CMD58)... */
		state = SD_SendCmd( SD_CMD_READ_OCR, 0x00000000, 0xFF );
		if ( state == SD_RESPONSE_NO_ERROR )
		{ /* get OCR register (R3 response) and check its CCS (bit 30) */
			SD_GetResponse4b( (uint8_t*)&res );
			cardType = ( res & 0x40000000 ) ? SD_Card_SDHC : SD_Card_SDSC_v2;
		}
	}
	/* else cardType == SD_Card_SDSC_v1 */

	state = SD_WaitReady();	/* make sure card is ready before we go further... */

	/* print out detected SD card type... */
	switch ( cardType )
	{
	case SD_Card_SDSC_v1:	printf( "SDSC v1 (byte address)" ); break;
	case SD_Card_SDSC_v2:	printf( "SDSC v2 (byte address)" ); break;
	case SD_Card_SDHC:		printf( "SDHC (512-bytes sector address)" ); break;
	case SD_Card_MMC:		printf( "MMC (byte address)" ); break;
	default:				printf( "UNKNOWN" ); break;
	}
	printf( " card initialized successfully\n" );

	return SD_RESPONSE_NO_ERROR;
}

/**
 * @brief  Recieve data from SD Card
 * @param  data: Pre-allocated data buffer
 * @param  len: Number of bytes to receive
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
static SD_Error SD_ReceiveData( uint8_t *data, uint16_t len )
{
	uint16_t i = 0;
	uint8_t b;

	/* some cards need time before transmitting the data... */
	b = SD_WaitBytesRead();

	if ( b != 0xFF )
	{	/* most cards send transmission start token, don't fail if it's not the case... */
		data[ i ] = b;
		if ( data[ i ] == SD_DATA_BLOCK_READ_START ) /* 0xFE */
			data[ i ] = SD_ReadByte();	/* just get the next byte... */

		/* receive the rest of data... */
		for ( i = 1; i < len; ++i )
			data[ i ] = SD_ReadByte();

		/* get CRC bytes (not really needed by us, but required by SD) */
		SD_ReadByte();
		SD_ReadByte();

		return SD_RESPONSE_NO_ERROR;
	}
	return SD_RESPONSE_FAILURE;
}

/**
 * @brief  Read the CSD card register.
 *         Reading the contents of the CSD register in SPI mode is a simple
 *         read-block transaction.
 * @param  SD_csd: pointer on an SCD register structure
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
static SD_Error SD_GetCSDRegister( SD_CSD* SD_csd )
{
	SD_Error state;
	uint8_t CSD_Tab[ 16 ];

	state = SD_WaitReady();	/* make sure card is ready before we go further... */
	if ( state != SD_RESPONSE_NO_ERROR )
		return SD_RESPONSE_FAILURE;

	/* request CSD register (send CMD9)... */
	state = SD_SendCmd( SD_CMD_SEND_CSD, 0x00000000, 0xFF );
	if ( state != SD_RESPONSE_NO_ERROR )
		return SD_RESPONSE_FAILURE;
	state = SD_ReceiveData( CSD_Tab, 16 );	/* receive CSD register data */

	SD_csd->CSDStruct = ( CSD_Tab[ 0 ] & 0xC0 ) >> 6;				/* Byte 0 */
	SD_csd->SysSpecVersion = ( CSD_Tab[ 0 ] & 0x3C ) >> 2;
	SD_csd->Reserved1 = CSD_Tab[ 0 ] & 0x03;
	SD_csd->TAAC = CSD_Tab[ 1 ];									/* Byte 1 */
	SD_csd->NSAC = CSD_Tab[ 2 ];									/* Byte 2 */
	SD_csd->MaxBusClkFrec = CSD_Tab[ 3 ];							/* Byte 3 */
	SD_csd->CardComdClasses = CSD_Tab[ 4 ] << 4;					/* Byte 4 */
	SD_csd->CardComdClasses |= ( CSD_Tab[ 5 ] & 0xF0 ) >> 4;		/* Byte 5 */
	SD_csd->RdBlockLen = CSD_Tab[ 5 ] & 0x0F;
	SD_csd->PartBlockRead = ( CSD_Tab[ 6 ] & 0x80 ) >> 7;			/* Byte 6 */
	SD_csd->WrBlockMisalign = ( CSD_Tab[ 6 ] & 0x40 ) >> 6;
	SD_csd->RdBlockMisalign = ( CSD_Tab[ 6 ] & 0x20 ) >> 5;
	SD_csd->DSRImpl = ( CSD_Tab[ 6 ] & 0x10 ) >> 4;
	SD_csd->Reserved2 = ( CSD_Tab[ 6 ] & 0x0C ) >> 2;
	if ( SD_csd->CSDStruct == 0 )
	{	/* v1 */
		SD_csd->DeviceSize = ( CSD_Tab[ 6 ] & 0x03 ) << 10;	/* DeviceSize has 12 bits here */
		SD_csd->DeviceSize |= CSD_Tab[ 7 ] << 2;					/* Byte 7 */
		SD_csd->DeviceSize |= ( CSD_Tab[ 8 ] & 0xC0 ) >> 6;			/* Byte 8 */
		SD_csd->MaxRdCurrentVDDMin = ( CSD_Tab[ 8 ] & 0x38 ) >> 3;
		SD_csd->MaxRdCurrentVDDMax = CSD_Tab[ 8 ] & 0x07;
		SD_csd->MaxWrCurrentVDDMin = ( CSD_Tab[ 9 ] & 0xE0 ) >> 5;	/* Byte 9 */
		SD_csd->MaxWrCurrentVDDMax = ( CSD_Tab[ 9 ] & 0x1C ) >> 2;
		SD_csd->DeviceSizeMul = ( CSD_Tab[ 9 ] & 0x03 ) << 1;
		SD_csd->DeviceSizeMul |= ( CSD_Tab[ 10 ] & 0x80 ) >> 7;		/* Byte 10 */
	}
	else
	{	/* v2 */
		SD_csd->Reserved5 = ( CSD_Tab[ 6 ] & 0x03 ) << 2;
		SD_csd->Reserved5 |= ( CSD_Tab[ 7 ] & 0xC0 ) >> 6;			/* Byte 7 */
		SD_csd->DeviceSize = ( CSD_Tab[ 7 ] & 0x3F ) << 16;	/* DeviceSize has 22 bits here */
		SD_csd->DeviceSize |= CSD_Tab[ 8 ] << 8;					/* Byte 8 */
		SD_csd->DeviceSize |= CSD_Tab[ 9 ];							/* Byte 9 */
		SD_csd->Reserved6 = ( CSD_Tab[ 10 ] & 0x80 ) >> 7;			/* Byte 10 */
	}
	SD_csd->EraseBlockEnable = ( CSD_Tab[ 10 ] & 0x40 ) >> 6;
	SD_csd->EraseSectorSize = ( CSD_Tab[ 10 ] & 0x3F ) << 1;
	SD_csd->EraseSectorSize |= ( CSD_Tab[ 11 ] & 0x80 ) >> 7;		/* Byte 11 */
	SD_csd->WrProtectGrSize = CSD_Tab[ 11 ] & 0x7F;
	SD_csd->WrProtectGrEnable = ( CSD_Tab[ 12 ] & 0x80 ) >> 7;		/* Byte 12 */
	SD_csd->ManDeflECC = ( CSD_Tab[ 12 ] & 0x60 ) >> 5;
	SD_csd->WrSpeedFact = ( CSD_Tab[ 12 ] & 0x1C ) >> 2;
	SD_csd->MaxWrBlockLen = ( CSD_Tab[ 12 ] & 0x03 ) << 2;
	SD_csd->MaxWrBlockLen |= ( CSD_Tab[ 13 ] & 0xC0 ) >> 6;			/* Byte 13 */
	SD_csd->WriteBlockPaPartial = ( CSD_Tab[ 13 ] & 0x20 ) >> 5;
	SD_csd->Reserved3 = CSD_Tab[ 13 ] & 0x1E;
	SD_csd->ContentProtectAppli = CSD_Tab[ 13 ] & 0x01;
	SD_csd->FileFormatGroup = ( CSD_Tab[ 14 ] & 0x80 ) >> 7;		/* Byte 14 */
	SD_csd->CopyFlag = ( CSD_Tab[ 14 ] & 0x40 ) >> 6;
	SD_csd->PermWrProtect = ( CSD_Tab[ 14 ] & 0x20 ) >> 5;
	SD_csd->TempWrProtect = ( CSD_Tab[ 14 ] & 0x10 ) >> 4;
	SD_csd->FileFormat = ( CSD_Tab[ 14 ] & 0x0C ) >> 2;
	SD_csd->ECC = CSD_Tab[ 14 ] & 0x03;
	SD_csd->CSD_CRC = ( CSD_Tab[ 15 ] & 0xFE ) >> 1;				/* Byte 15 */
	SD_csd->Reserved4 = CSD_Tab[ 15 ] & 0x01;

	return state;
}

/**
 * @brief  Read the CID card register.
 *         Reading the contents of the CID register in SPI mode is a simple
 *         read-block transaction.
 * @param  SD_cid: pointer on an CID register structure
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
static SD_Error SD_GetCIDRegister( SD_CID* SD_cid )
{
	SD_Error state;
	uint8_t CID_Tab[ 16 ];

	state = SD_WaitReady();	/* make sure card is ready before we go further... */
	if ( state != SD_RESPONSE_NO_ERROR )
		return SD_RESPONSE_FAILURE;

