erley/stm32-sdcard/sdcard/sys/BSP/stm32_sd_spi.c
	/* request CID register (send CMD10)... */
	state = SD_SendCmd( SD_CMD_SEND_CID, 0x00000000, 0xFF );
	if ( state != SD_RESPONSE_NO_ERROR )
		return SD_RESPONSE_FAILURE;
	state = SD_ReceiveData( CID_Tab, 16 );	/* receive CID register data */

	SD_cid->ManufacturerID = CID_Tab[ 0 ];				/* Byte 0 */
	SD_cid->OEM_AppliID = CID_Tab[ 1 ] << 8;			/* Byte 1 */
	SD_cid->OEM_AppliID |= CID_Tab[ 2 ];				/* Byte 2 */
	SD_cid->ProdName1 = CID_Tab[ 3 ] << 24;				/* Byte 3 */
	SD_cid->ProdName1 |= CID_Tab[ 4 ] << 16;			/* Byte 4 */
	SD_cid->ProdName1 |= CID_Tab[ 5 ] << 8;				/* Byte 5 */
	SD_cid->ProdName1 |= CID_Tab[ 6 ];					/* Byte 6 */
	SD_cid->ProdName2 = CID_Tab[ 7 ];					/* Byte 7 */
	SD_cid->ProdRev = CID_Tab[ 8 ];						/* Byte 8 */
	SD_cid->ProdSN = CID_Tab[ 9 ] << 24;				/* Byte 9 */
	SD_cid->ProdSN |= CID_Tab[ 10 ] << 16;				/* Byte 10 */
	SD_cid->ProdSN |= CID_Tab[ 11 ] << 8;				/* Byte 11 */
	SD_cid->ProdSN |= CID_Tab[ 12 ];					/* Byte 12 */
	SD_cid->Reserved1 |= ( CID_Tab[ 13 ] & 0xF0 ) >> 4;	/* Byte 13 */
	SD_cid->ManufactDate = ( CID_Tab[ 13 ] & 0x0F ) << 8;
	SD_cid->ManufactDate |= CID_Tab[ 14 ];				/* Byte 14 */
	SD_cid->CID_CRC = ( CID_Tab[ 15 ] & 0xFE ) >> 1;	/* Byte 15 */
	SD_cid->Reserved2 = 1;

	return state;
}

/**
 * @brief  Read the SCR card register.
 *         Reading the contents of the SCR register in SPI mode is a simple
 *         read-block transaction.
 * @param  SD_scr: pointer on an SCR register structure
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
static SD_Error SD_GetSCRRegister( SD_SCR* SD_scr )
{
	SD_Error state;
	uint8_t SCR_Tab[ 8 ];

	if ( cardType == SD_Card_MMC )
	{
		printf( "SCR Register is not available for MMC cards\n" );
		return SD_ILLEGAL_COMMAND;
	}

	state = SD_WaitReady();	/* make sure card is ready before we go further... */
	if ( state != SD_RESPONSE_NO_ERROR )
		return SD_RESPONSE_FAILURE;

	/* request SCR register (send ACMD51)... */
	state = SD_SendCmd( SD_CMD_SEND_APP, 0x00000000, 0x65 );
	if ( state == SD_RESPONSE_NO_ERROR )
		state = SD_SendCmd( SD_CMD_SEND_SCR, 0x00000000, 0xFF );
	if ( state != SD_RESPONSE_NO_ERROR )
		return SD_RESPONSE_FAILURE;
	state = SD_ReceiveData( SCR_Tab, 8 );	/* receive SCR register data */

	SD_scr->SCR_Version = ( SCR_Tab[ 0 ] & 0xF0 ) >> 4;		/* Byte 0 */
	SD_scr->SpecVersion = SCR_Tab[ 0 ] & 0x0F;
	SD_scr->StateAfterErase = ( SCR_Tab[ 1 ] & 0x80 ) >> 7;	/* Byte 1 */
	SD_scr->Security = ( SCR_Tab[ 1 ] & 0x70 ) >> 4;
	SD_scr->BusWidth = SCR_Tab[ 1 ] & 0x0F;
	SD_scr->SpecVersion3 = ( SCR_Tab[ 2 ] & 0x80 ) >> 7;	/* Byte 2 */
	SD_scr->ExSecurity = ( SCR_Tab[ 2 ] & 0x78 ) >> 3;
	SD_scr->Reserved1 = ( SCR_Tab[ 2 ] & 0x07 ) << 6;
	SD_scr->Reserved1 |= ( SCR_Tab[ 3 ] & 0xFC ) >> 2;		/* Byte 3 */
	SD_scr->CmdSupport1 = ( SCR_Tab[ 3 ] & 0x02 ) >> 1;
	SD_scr->CmdSupport2 = SCR_Tab[ 3 ] & 0x01;
	SD_scr->Reserved2 = SCR_Tab[ 4 ] << 24;					/* Byte 4 */
	SD_scr->Reserved2 |= SCR_Tab[ 5 ] << 16;				/* Byte 5 */
	SD_scr->Reserved2 |= SCR_Tab[ 6 ] << 8;					/* Byte 6 */
	SD_scr->Reserved2 |= SCR_Tab[ 7 ];						/* Byte 7 */

	return state;
}

/**
 * @}
 *//* STM32_Private_Functions */


/** @defgroup STM32_Public_Functions
 * @{
 */

/**
 * @brief  Detect if SD card is correctly plugged in the memory slot.
 * @param  None
 * @retval Return if SD is detected or not
 */
uint8_t SD_Detect( void )
{	/* check GPIO to detect SD */
	if ( GPIO_ReadInputData( SD_DETECT_GPIO_PORT ) & SD_DETECT_PIN )
		return SD_NOT_PRESENT;
	return SD_PRESENT;
}

/**
 * @brief  DeInitializes the SD Card
 * @param  None
 * @retval None
 */
void SD_DeInit( void )
{	/* just shutdown SPI bus - disable SD CS Clock */
	SD_CS_GPIO_CLK_INIT( SD_CS_GPIO_CLK, DISABLE );
}

/**
 * @brief  Initializes the SD Card
 * @param  None
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_Init( void )
{
	GPIO_InitTypeDef GPIO_InitStructure;
	SD_Error state;
	uint32_t i = 0;

	/* step 0:
	 * Check if SD card is present... */
	if ( SD_Detect() == SD_NOT_PRESENT )
		return SD_RESPONSE_FAILURE;

	/* step 1:
	 * Initialize SD card-related pins on SPI bus */
	SD_CS_GPIO_CLK_INIT( SD_CS_GPIO_CLK, ENABLE );	/* enable SD CS clock... */
	GPIO_InitStructure.GPIO_Pin = SD_CS_PIN;		/* configure SD CS pin... */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init( SD_CS_GPIO_PORT, &GPIO_InitStructure );

	/* step 2:
	 * Card is now powered up (i.e. 1ms at least elapsed at 0.5V),
	 * Supply rump up time (set MOSI HIGH) to let voltage reach stable 2.2V at least.
	 * According to the specs it must be 74 SPI clock cycles minimum at 100-400Khz
	 * At 25Mhz it'll be 250 times more cycles => send 2500 times 0xFF byte.
	 * Chip Select pin should be set HIGH too. */

	/* set SD chip select pin high */
	GPIO_SetBits( SD_CS_GPIO_PORT, SD_CS_PIN );
	/* send dummy byte 0xFF (rise MOSI high for 2500*8 SPI bus clock cycles) */
	while ( i++ < SD_NUM_TRIES_RUMPUP )
		SD_WriteByte( SD_DUMMY_BYTE );

	/* step 3:
	 * Put SD in SPI mode & perform soft reset */
	state = SD_GoIdleState();

	/* step 4:
	 * Force sector size to SD_BLOCK_SIZE (i.e. 512 bytes) */
	if ( state == SD_RESPONSE_NO_ERROR && cardType != SD_Card_SDHC )
		state = SD_FixSectorSize( (uint16_t)SD_BLOCK_SIZE );

	/* step 5:
	 * Release SPI bus for other devices */
	SD_Bus_Release();

	return state;
}

/**
 * @brief  Reads a sector of SD_BLOCK_SIZE bytes from the SD card
 * @param  pBuffer: pointer to the buffer that receives the data read from SD.
 * @param  readAddr: SD's internal address to read from (sector number)
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_SectorRead( uint32_t readAddr, uint8_t* pBuffer )
{
	SD_Error state;

	printf( "--> reading sector %lu ...", readAddr );

	/* non High Capacity cards use byte-oriented addresses */
	if ( cardType != SD_Card_SDHC )
		readAddr <<= 9;

	SD_Bus_Hold();		/* hold SPI bus... */

	state = SD_WaitReady();	/* make sure card is ready before we go further... */

