erley/stm32-sdcard/sdcard/sys/BSP/stm32_sd_spi.c
	/* send CMD17 (SD_CMD_READ_SINGLE_BLOCK) to read one block */
	state = SD_SendCmd( SD_CMD_READ_SINGLE_BLOCK, readAddr, 0xFF );
	/* receive data if command acknowledged... */
	if ( state == SD_RESPONSE_NO_ERROR )
		state = SD_ReceiveData( pBuffer, SD_BLOCK_SIZE );

	SD_Bus_Release();	/* release SPI bus... */

	if ( state == SD_RESPONSE_NO_ERROR )
		printf( "OK\n" );
	else
		printf( "KO(%d)\n", state );

	return state;
}

/**
 * @brief  Reads multiple sectors of SD_BLOCK_SIZE bytes from the SD card
 * @param  pBuffer: pointer to the buffer that receives the data read from SD.
 * @param  readAddr: SD's internal address to read from.
 * @param  nbSectors: number of blocks to be read.
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_SectorsRead( uint32_t readAddr, uint8_t* pBuffer, uint32_t nbSectors )
{
	SD_Error state;

	printf( "--> reading %lu sectors from %lu ...", nbSectors, readAddr );

	/* non High Capacity cards use byte-oriented addresses */
	if ( cardType != SD_Card_SDHC )
		readAddr <<= 9;

	SD_Bus_Hold();		/* hold SPI bus... */

	state = SD_WaitReady();	/* make sure card is ready before we go further... */

	/* send CMD18 (SD_CMD_READ_MULT_BLOCK) to read multiple blocks */
	state = SD_SendCmd( SD_CMD_READ_MULT_BLOCK, readAddr, 0xFF );
	if ( state == SD_RESPONSE_NO_ERROR )
	{	/* receive data... */
		while ( nbSectors-- > 0 )
		{
			state = SD_ReceiveData( pBuffer, SD_BLOCK_SIZE );
			if ( state != SD_RESPONSE_NO_ERROR )
				break;
			pBuffer += SD_BLOCK_SIZE;
		}
		/* transmission is open-ended (no block count was set) =>
		 * send CMD12 (SD_CMD_STOP_TRANSMISSION) to stop it... */
		state = SD_SendCmd( SD_CMD_STOP_TRANSMISSION, 0x00000000, 0xFF );
	}

	SD_Bus_Release();	/* release SPI bus... */

	if ( state == SD_RESPONSE_NO_ERROR )
		printf( "OK\n" );
	else
		printf( "KO(%d)\n", state );

	return state;
}

/**
 * @brief  Writes a sector of SD_BLOCK_SIZE bytes on the SD card
 * @param  pBuffer: pointer to the buffer with the data to be written on SD.
 * @param  writeAddr: address to write on.
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_SectorWrite( uint32_t writeAddr, const uint8_t* pBuffer )
{
	SD_Error state;
	SD_DataResponse res;
	uint16_t BlockSize = SD_BLOCK_SIZE;

	printf( "--> writing sector %lu ...", writeAddr );

	/* non High Capacity cards use byte-oriented addresses */
	if ( cardType != SD_Card_SDHC )
		writeAddr <<= 9;

	SD_Bus_Hold();		/* hold SPI bus... */

	state = SD_WaitReady();	/* make sure card is ready before we go further... */

	/* send CMD24 (SD_CMD_WRITE_SINGLE_BLOCK) to write single block */
	state = SD_SendCmd( SD_CMD_WRITE_SINGLE_BLOCK, writeAddr, 0xFF );
	if ( state == SD_RESPONSE_NO_ERROR )
	{	/* wait at least 8 clock cycles (send >=1 0xFF bytes) before transmission starts */
		SD_ReadByte();
		SD_ReadByte();
		SD_ReadByte();
		/* send data token to signify the start of data transmission... */
		SD_WriteByte( SD_DATA_SINGLE_BLOCK_WRITE_START ); /* 0xFE */
		/* send data... */
		while ( BlockSize-- > 0 )
			SD_WriteByte( *pBuffer++ );
		/* put 2 CRC bytes (not really needed by us, but required by SD) */
		SD_ReadByte();
		SD_ReadByte();
		/* check data response... */
		res = (SD_DataResponse)( SD_ReadByte() & SD_RESPONSE_MASK );	/* mask unused bits */
		if ( ( res & SD_RESPONSE_ACCEPTED ) != 0 )
		{	/* card is now processing data and goes to BUSY mode, wait until it finishes... */
			state = SD_WaitBytesWritten();	/* make sure card is ready before we go further... */
		}
		else
			state = SD_RESPONSE_FAILURE;
	}

	SD_Bus_Release();	/* release SPI bus... */

	if ( state == SD_RESPONSE_NO_ERROR )
		printf( "OK\n" );
	else
		printf( "KO(%d)\n", state );

	return state;
}

/**
 * @brief  Writes multiple sectors of SD_BLOCK_SIZE bytes on the SD card
 * @param  pBuffer: pointer to the buffer with the data to be written on the SD.
 * @param  writeAddr: address to write on.
 * @param  nbSectors: number of blocks to be written.
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_SectorsWrite( uint32_t writeAddr, const uint8_t* pBuffer, uint32_t nbSectors )
{
	SD_Error state;
	SD_DataResponse res;
	uint16_t BlockSize = SD_BLOCK_SIZE;

	printf( "--> writing %lu sectors at %lu ...", nbSectors, writeAddr );

	/* non High Capacity cards use byte-oriented addresses */
	if ( cardType != SD_Card_SDHC )
		writeAddr <<= 9;

	SD_Bus_Hold();		/* hold SPI bus... */

	state = SD_WaitReady();	/* make sure card is ready before we go further... */

	/* it is recommended to specify in advance the number of blocks being written
	 * to let SD card erase needed number of blocks, write operation should take less time then */
	if ( cardType != SD_Card_MMC )
	{	/* notify card about the total number of blocks to be sent (send CMD23)... */
		state = SD_SendCmd( SD_CMD_SET_BLOCK_COUNT, (uint32_t)nbSectors, 0xFF );
		if ( state != SD_RESPONSE_NO_ERROR )
		{
			SD_Bus_Release();	/* release SPI bus... */
			return state;
		}
	}

	/* request writing data starting from the given address (send CMD25)... */
	state = SD_SendCmd( SD_CMD_WRITE_MULT_BLOCK, writeAddr, 0xFF );
	if ( state == SD_RESPONSE_NO_ERROR )
	{
		/* send some dummy bytes before transmission starts... */
		SD_ReadByte();
		SD_ReadByte();
		SD_ReadByte();
		/* transfer data... */
		while ( nbSectors-- > 0 && state != SD_RESPONSE_FAILURE )
		{	/* --- {{ send data packet */
			SD_WriteByte( SD_DATA_MULTIPLE_BLOCK_WRITE_START ); /* 0xFC */
			/* send data... */
			while ( BlockSize-- > 0 )
				SD_WriteByte( *pBuffer++ );
			/* put CRC bytes (not really needed by us, but required by SD) */
			SD_ReadByte();
			SD_ReadByte();
			/* --- }} */
			/* check data response... */
			res = (SD_DataResponse)( SD_ReadByte() & SD_RESPONSE_MASK );	/* mask unused bits */
			if ( ( res & SD_RESPONSE_ACCEPTED ) != 0 )
			{	/* card is now processing data and goes to BUSY mode, wait until it finishes... */
				state = SD_WaitBytesWritten();	/* make sure card is ready before we go further... */
			}
			else
				state = SD_RESPONSE_FAILURE;
		}
		/* notify SD card that we finished sending data to write on it */
		SD_WriteByte( SD_DATA_MULTIPLE_BLOCK_WRITE_STOP ); /* 0xFD */
		SD_ReadByte(); /* read and discard 1 byte from card */
		/* card is now processing data and goes to BUSY mode, wait until it finishes... */
		state = SD_WaitReady();	/* make sure card is ready before we go further... */
	}

	SD_Bus_Release();	/* release SPI bus... */

	if ( state == SD_RESPONSE_NO_ERROR )
		printf( "OK\n" );
	else
		printf( "KO(%d)\n", state );

	return state;
}

/**
 * @brief  Erase specified range of sectors on SD card
 * @param  eraseAddrFrom: Starting sector number
 * @param  eraseAddrTo: End sector number
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_SectorsErase( uint32_t eraseAddrFrom, uint32_t eraseAddrTo )
{
	SD_Error state;

