erley/stm32-sdcard/sdcard/sys/BSP/stm32_sd_spi.c
	if ( cardType == SD_Card_MMC )
	{
		printf( "--> erasing sectors is not supported for MMC cards\n" );
		return SD_ILLEGAL_COMMAND;
	}

	printf( "--> erasing sectors from %lu to %lu ...", eraseAddrFrom, eraseAddrTo );

	/* non High Capacity cards use byte-oriented addresses */
	if ( cardType != SD_Card_SDHC )
	{
		eraseAddrFrom <<= 9;
		eraseAddrTo <<= 9;
	}

	SD_Bus_Hold();		/* hold SPI bus... */

	state = SD_WaitReady();	/* make sure card is ready before we go further... */

	/* send starting block address (CMD32)... */
	state = SD_SendCmd( SD_CMD_ERASE_BLOCK_START, (uint32_t)eraseAddrFrom, 0xFF );
	if ( state == SD_RESPONSE_NO_ERROR )
	{	/* send end block address (CMD33)... */
		state = SD_SendCmd( SD_CMD_ERASE_BLOCK_END, (uint32_t)eraseAddrTo, 0xFF );
		if ( state == SD_RESPONSE_NO_ERROR )
		{	/* erase all selected blocks (CMD38)... */
			state = SD_SendCmd( SD_CMD_ERASE, 0x00000000, 0xFF );
			if ( state == SD_RESPONSE_NO_ERROR )
			{	/* wait until sectors get erased... */
				state = SD_WaitBytesErased();	/* make sure card is ready before we go further... */
			}
		}
	}

	SD_Bus_Release();	/* release SPI bus... */

	if ( state == SD_RESPONSE_NO_ERROR )
		printf( "OK\n" );
	else
		printf( "KO(%d)\n", state );

	return state;
}

/**
 * @brief  Retrieve current SD card status structure
 * @param  SD_status: pointer on an SD_Status structure
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_GetStatus( SD_Status* SD_status )
{
	SD_Error state;
	uint8_t status[ 64 ];

	if ( cardType == SD_Card_MMC )
	{
		printf( "SD card status is not available for MMC cards\n" );
		return SD_ILLEGAL_COMMAND;
	}

	SD_Bus_Hold();		/* hold SPI bus... */

	state = SD_WaitReady();	/* make sure card is ready before we go further... */
	if ( state != SD_RESPONSE_NO_ERROR )
		return SD_RESPONSE_FAILURE;

	/* request SD card status (send ACMD13)... */
	state = SD_SendCmd( SD_CMD_SEND_APP, 0x00000000, 0x65 );
	if ( state == SD_RESPONSE_NO_ERROR )
		state = SD_SendCmd( SD_CMD_STATUS, 0x00000000, 0xFF );
	if ( state != SD_RESPONSE_NO_ERROR )
		return SD_RESPONSE_FAILURE;
	state = SD_ReceiveData( status, 64 );	/* receive SD card status data */

	SD_Bus_Release();	/* release SPI bus... */

	SD_status->BusWidth = ( status[ 0 ] & 0xC0 ) >> 6;		/* Byte 0 */
	SD_status->InSecuredMode = ( status[ 0 ] & 0x20 ) >> 5;
	SD_status->Reserved1 = ( status[ 0 ] & 0x1F ) << 8;
	SD_status->Reserved1 |= status[ 1 ];					/* Byte 1 */
	SD_status->CardType = status[ 2 ] << 8;					/* Byte 2 */
	SD_status->CardType |= status[ 3 ];						/* Byte 3 */
	SD_status->SizeProtectedArea = status[ 4 ] << 24;		/* Byte 4 */
	SD_status->SizeProtectedArea |= status[ 5 ] << 16;		/* Byte 5 */
	SD_status->SizeProtectedArea |= status[ 6 ] << 8;		/* Byte 6 */
	SD_status->SizeProtectedArea |= status[ 7 ];			/* Byte 7 */
	SD_status->SpeedClass = status[ 8 ];					/* Byte 8 */
	SD_status->PerformanceMove = status[ 9 ];				/* Byte 9 */
	SD_status->AU_Size = ( status[ 10 ] & 0xF0 ) >> 4;		/* Byte 10 */
	SD_status->Reserved2 = status[ 10 ] & 0x0F;
	SD_status->EraseSize = status[ 11 ] << 8;				/* Byte 11 */
	SD_status->EraseSize |= status[ 12 ];					/* Byte 12 */
	SD_status->EraseTimeout = ( status[ 13 ] & 0xFC ) >> 2;	/* Byte 13 */
	SD_status->EraseOffset = status[ 13 ] & 0x03;
	SD_status->UHS_SpeedGrade = ( status[ 14 ] & 0xF0 ) >> 4;/* Byte 14 */
	SD_status->UHS_AU_Size = status[ 14 ] & 0x0F;

	return state;
}

/**
 * @brief  Returns information about specific card.
 * @param  cardinfo: pointer to a SD_CardInfo structure that contains all SD
 *         card information.
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_GetCardInfo( SD_CardInfo *cardinfo )
{
	SD_Error status;

	SD_Bus_Hold();		/* hold SPI bus... */

	status = SD_GetCSDRegister( &(cardinfo->SD_csd) );
	if ( status == SD_RESPONSE_NO_ERROR )
		status = SD_GetCIDRegister( &(cardinfo->SD_cid) );
	if ( status == SD_RESPONSE_NO_ERROR && cardType != SD_Card_MMC )
		status = SD_GetSCRRegister( &(cardinfo->SD_scr) );

	SD_Bus_Release();	/* release SPI bus... */

	if ( status == SD_RESPONSE_NO_ERROR )
	{	/* to avoid overflow, card capacity is calculated in Kbytes */
		if ( cardinfo->SD_csd.CSDStruct == 0 )
		{	// v1:
			cardinfo->CardCapacity = cardinfo->SD_csd.DeviceSize + 1;
			cardinfo->CardCapacity *= ( 1 << ( cardinfo->SD_csd.DeviceSizeMul + 2 ) );
			cardinfo->CardBlockSize = 1 << cardinfo->SD_csd.RdBlockLen;
			if ( cardinfo->SD_csd.RdBlockLen > 10 )
				cardinfo->CardCapacity *= ( 1 << ( cardinfo->SD_csd.RdBlockLen - 10 ) );
			else
				cardinfo->CardCapacity /= ( 1 << ( 10 - cardinfo->SD_csd.RdBlockLen ) );
		}
		else
		{	// v2:
			cardinfo->CardCapacity = cardinfo->SD_csd.DeviceSize + 1;
			cardinfo->CardBlockSize = 1 << cardinfo->SD_csd.RdBlockLen;
			cardinfo->CardCapacity *= cardinfo->CardBlockSize;
		}
	}

	return status;
}

/**
 * @brief  Prints out human-readable information about SD Card
 * @param  Previously retrieved card info structure
 * @retval None
 */
void SD_DumpCardInfo( const SD_CardInfo *cardinfo )
{
	uint8_t is_OSRv1 = ( cardinfo->SD_csd.CSDStruct == 0 );
	printf( "\nDumping SD Card information:\n\n    GLOBAL INFO\nSD Card type : " );
	/* some cards report wrong CSDStruct field in CSR register => use detected card type instead... */
	if ( is_OSRv1 != 0 )
		printf( "SDSC (v1 or v2)\n" );
	else
		printf( "SDHC or SDXC\n" );
	printf( "Card Capacity : %lu Kbytes\n", cardinfo->CardCapacity );
	printf( "Card Block Size : %lu bytes\n", cardinfo->CardBlockSize );

	printf( "\n    Card identification register (CID)\n" );
	printf( "Manufacturer ID : %d\n", cardinfo->SD_cid.ManufacturerID );
	printf( "OEM / Application ID : %c%c\n",
		((char*)&( cardinfo->SD_cid.OEM_AppliID ))[ 1 ],
		((char*)&( cardinfo->SD_cid.OEM_AppliID ))[ 0 ] );
	printf( "Product Name : %c%c%c%c%c\n",
		((char*)&( cardinfo->SD_cid.ProdName1 ))[ 3 ],
		((char*)&( cardinfo->SD_cid.ProdName1 ))[ 2 ],
		((char*)&( cardinfo->SD_cid.ProdName1 ))[ 1 ],
		((char*)&( cardinfo->SD_cid.ProdName1 ))[ 0 ],
		(char)(    cardinfo->SD_cid.ProdName2 )	);
	printf( "Product Revision : %d.%d\n",
		( cardinfo->SD_cid.ProdRev & 0xF0 ) >> 4,
		( cardinfo->SD_cid.ProdRev & 0x0F ) );
	printf( "Product Serial Number : %lu\n",
		cardinfo->SD_cid.ProdSN );
	printf( "Manufacturing Date (YYYY-MM) : %d-%d\n",
		2000 + ( ( cardinfo->SD_cid.ManufactDate & 0x0FF0 ) >> 4 ),
		cardinfo->SD_cid.ManufactDate & 0x000F );
	printf( "CID CRC : %d\n", cardinfo->SD_cid.CID_CRC & 0x7F );

	printf( "\n    Card-specific data register (CSD)\n" );
	if ( is_OSRv1 != 0 )
	{
		printf( "Data read access-time : " );
		switch ( (cardinfo->SD_csd.TAAC & 0x78) >> 3 )
		{
		case 0x0: printf( "0.0" ); break;
		case 0x1: printf( "1.0" ); break;
		case 0x2: printf( "1.2" ); break;
		case 0x3: printf( "1.3" ); break;
		case 0x4: printf( "1.5" ); break;
		case 0x5: printf( "2.0" ); break;
		case 0x6: printf( "2.5" ); break;
		case 0x7: printf( "3.0" ); break;
		case 0x8: printf( "3.5" ); break;
		case 0x9: printf( "4.0" ); break;
		case 0xA: printf( "4.5" ); break;
		case 0xB: printf( "5.0" ); break;
		case 0xC: printf( "5.5" ); break;
		case 0xD: printf( "6.0" ); break;
		case 0xE: printf( "7.0" ); break;
		case 0xF: printf( "8.0" ); break;
		default: break;
		}
		printf( " x 1" );
		switch ( cardinfo->SD_csd.TAAC & 0x07 )
		{
		case 0: printf( "n" ); break;
		case 1: printf( "0n" ); break;
		case 2: printf( "00n" ); break;
		case 3: printf( "u" ); break;
		case 4: printf( "0u" ); break;
		case 5: printf( "00u" ); break;
		case 6: printf( "m" ); break;
		case 7: printf( "0m" ); break;
		default: break;
		}
		printf( "s\nData read access-time in CLK cycles : %d\n", cardinfo->SD_csd.NSAC );
	}
	printf( "Max. bus clock frequency : %x", cardinfo->SD_csd.MaxBusClkFrec );
	switch ( cardinfo->SD_csd.MaxBusClkFrec )
	{
	case 0x32: printf( " (25Mhz)\n" ); break;
	case 0x5A: printf( " (50Mhz)\n" ); break;
	case 0x0B: printf( " (100Mhz)\n" ); break;
	case 0x2B: printf( " (200Mhz)\n" ); break;
	default:   printf( "\n" ); break;
	}
	printf( "\nCard command classes :" );
	if ( cardinfo->SD_csd.CardComdClasses & ( 0x001 ))	printf( " 0(basic)" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 << 1) )	printf( " 1" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 << 2) )	printf( " 2(read)" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 << 3) )	printf( " 3" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 << 4) )	printf( " 4(write)" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 << 5) )	printf( " 5(erase)" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 << 6) )	printf( " 6(protect)" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 << 7) )	printf( " 7(lock)" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 << 8) )	printf( " 8(app)" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 << 9) )	printf( " 9(i/o)" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 <<10) )	printf( " 10(switch)" );
	if ( cardinfo->SD_csd.CardComdClasses & (1 <<11) )	printf( " 11" );
	printf( "\n" );

	if ( is_OSRv1 != 0 )
	{
		printf( "Max. read data block length : %d ( %d bytes )\n",
			cardinfo->SD_csd.RdBlockLen,
			1 << (cardinfo->SD_csd.RdBlockLen) );
		printf( "Partial blocks for read allowed : %d\n", cardinfo->SD_csd.PartBlockRead );
		printf( "Write block misalignment : %d\n", cardinfo->SD_csd.WrBlockMisalign );
		printf( "Read block misalignment : %d\n", cardinfo->SD_csd.RdBlockMisalign );
	}
	else
	{
		printf( "Max. read data block length : always 512 bytes\n" );
		printf( "Partial blocks for read are not allowed\n" );
		printf( "Read/Write block misalignment is not allowed\n" );
	}
	printf( "DSR implemented : %d\n", cardinfo->SD_csd.DSRImpl );
	printf( "Device Size (4112 <= and <= 65375): %lu\n", cardinfo->SD_csd.DeviceSize );

	if ( is_OSRv1 != 0 )
	{
		printf( "Max. read current at VDD min : " );
		switch ( cardinfo->SD_csd.MaxRdCurrentVDDMin )
		{
		case 0: printf( "0.5" ); break;
		case 1: printf( "1" ); break;
		case 2: printf( "5" ); break;
		case 3: printf( "10" ); break;
		case 4: printf( "25" ); break;
		case 5: printf( "35" ); break;
		case 6: printf( "60" ); break;
		case 7: printf( "100" ); break;
		default: break;
		}
		printf( "mA\nMax. read current at VDD max : " );
		switch ( cardinfo->SD_csd.MaxRdCurrentVDDMax )
		{
		case 0: printf( "0.5" ); break;
		case 1: printf( "1" ); break;
		case 2: printf( "5" ); break;
		case 3: printf( "10" ); break;
		case 4: printf( "25" ); break;
		case 5: printf( "35" ); break;
		case 6: printf( "60" ); break;
		case 7: printf( "100" ); break;
		default: break;
		}
		printf( "mA\nMax. write current at VDD min : " );
		switch ( cardinfo->SD_csd.MaxWrCurrentVDDMin )
		{
		case 0: printf( "1" ); break;
		case 1: printf( "5" ); break;
		case 2: printf( "10" ); break;
		case 3: printf( "25" ); break;
		case 4: printf( "35" ); break;
		case 5: printf( "45" ); break;
		case 6: printf( "80" ); break;
		case 7: printf( "200" ); break;
		default: break;
		}
		printf( "mA\nMax. write current at VDD max : " );
		switch ( cardinfo->SD_csd.MaxWrCurrentVDDMax )
		{
		case 0: printf( "1" ); break;
		case 1: printf( "5" ); break;
		case 2: printf( "10" ); break;
		case 3: printf( "25" ); break;
		case 4: printf( "35" ); break;
		case 5: printf( "45" ); break;
		case 6: printf( "80" ); break;
		case 7: printf( "200" ); break;
		default: break;
		}
		printf( "mA\nDevice size multiplier : %d\n", cardinfo->SD_csd.DeviceSizeMul );
		if ( cardinfo->SD_csd.EraseBlockEnable == 0 )
			printf( "Erase size : 1 or more units of %d bytes each\n", cardinfo->SD_csd.EraseSectorSize );
		else
			printf( "Erase size : 1 or more blocks of 512 bytes each\n" );

		printf( "Write protect group size : %d\n", cardinfo->SD_csd.WrProtectGrSize );
		printf( "Write protect group enable : %d\n", cardinfo->SD_csd.WrProtectGrEnable );
		printf( "Write speed factor (Twrite/Tread) : %d\n", 1 << ( cardinfo->SD_csd.WrSpeedFact & 0x3F ) );
		printf( "Max. write data block length : %d\n", 1 << ( cardinfo->SD_csd.MaxWrBlockLen & 0xF ) );
		printf( "Partial blocks for write allowed : %d\n", cardinfo->SD_csd.WriteBlockPaPartial );
		printf( "File format group : %d\n", cardinfo->SD_csd.FileFormatGroup );
	}
	else
	{
		printf( "Erase size : 1 or more blocks of 512 bytes each\n" );
		printf( "Write protect group disabled\n" );
		printf( "Write timeout : 250ms\n" );
		printf( "Max. write data block length : 512 bytes\n" );
		printf( "Partial blocks for write are not allowed\n" );
	}
	printf( "Copy flag (OTP) : %d\n", cardinfo->SD_csd.CopyFlag );
	printf( "Permanent write protection : %d\n", cardinfo->SD_csd.PermWrProtect );
	printf( "Temporary write protection : %d\n", cardinfo->SD_csd.TempWrProtect );

	if ( is_OSRv1 != 0 )
	{
		printf( "File Format : " );
		switch ( cardinfo->SD_csd.FileFormat )
		{
		case 0: printf( "HDD-like file system with partition table\n" ); break;
		case 1: printf( "DOS FAT (FDD-like) with boot sector only (no partition table)\n" ); break;
		case 2: printf( "Universal File Format\n" ); break;
		case 3: printf( "Others/Unknown\n" ); break;
		default: break;
		}
	}
	printf( "CSD CRC : %d\n", cardinfo->SD_csd.CSD_CRC );

	if ( cardType != SD_Card_MMC )
	{
		printf( "\n    SD Card configuration register (SCR)\n" );
		printf( "SCR structure version : %d\n", cardinfo->SD_scr.SCR_Version );
		printf( "Physical layer specification version number : " );
		switch ( cardinfo->SD_scr.SpecVersion )
		{
		case 0: printf( "Version 1.0 and 1.01" ); break;
		case 1: printf( "Version 1.10" ); break;
		case 2:	printf( "Version %s", ( cardinfo->SD_scr.SpecVersion3 == 0 ) ? "2.00" : "3.0x" ); break;
		default:printf( "reserved" ); break;
		}
		printf( "\nState of bits after sector erase : 0x%s\n", cardinfo->SD_scr.StateAfterErase ? "FF" : "00" );
		printf( "CPRM security version : " );
		switch ( cardinfo->SD_scr.Security )
		{
		case 0: printf( "no security" ); break;
		case 1: printf( "not used" ); break;
		case 2: printf( "SDSC security ver 1.01" ); break;
		case 3: printf( "SDHC security ver 2.00" ); break;
		case 4: printf( "SDXC security ver 3.xx" ); break;
		default:printf( "reserved" ); break;
		}
		printf( "\nSupported data bus width :" );
		if ( cardinfo->SD_scr.BusWidth & 0x01 ) printf( " 1 bit" );
		if ( cardinfo->SD_scr.BusWidth & 0x04 ) printf( " 4 bit" );
		printf( "\nExtended security is%s supported\n", ( cardinfo->SD_scr.ExSecurity == 0 ) ? " not" : "" );
		printf( "Support of CMD23 (set block count) : %c\n", cardinfo->SD_scr.CmdSupport1 ? 'Y' : 'N' );
		printf( "Support of CMD20 (speed class control) : %c\n", cardinfo->SD_scr.CmdSupport2 ? 'Y' : 'N' );
	}
	printf( "\nDONE\n" );
}

/**
 * @brief  Prints out SD card status in human-readable form
 * @param  Previously retrieved SD card status structure
 * @retval None
 */
void SD_DumpStatus( const SD_Status* SD_status )
{
	printf( "\nDumping SD Card status information:\n\n" );
	if ( cardType != SD_Card_MMC )
	{
		printf( "Bus width : " );
		switch( SD_status->BusWidth )
		{
		case 0x00: printf( "1 bit" ); break;
		case 0x02: printf( "4 bits" ); break;
		default: printf( "reserved" ); break;
		}
		printf( "\nSD card is%s in secured mode\n", SD_status->InSecuredMode ? "" : " not" );
		printf( "Card Type : " );
		switch ( SD_status->CardType )
		{
		case 0x0000: printf( "Regular SD card" ); break;
		case 0x0001: printf( "SD ROM card" ); break;
		case 0x0002: printf( "OTP card" ); break;
		default: printf( "other card" ); break;
		}
		printf( "\nSize of protected area : %lu\n", SD_status->SizeProtectedArea );
		printf( "Speed class : " );
		switch( SD_status->SpeedClass )
		{
		case 0x00: printf( "Class 0"  ); break;
		case 0x01: printf( "Class 2"  ); break;
		case 0x02: printf( "Class 4"  ); break;
		case 0x03: printf( "Class 6"  ); break;
		case 0x04: printf( "Class 10" ); break;
		default:   printf( "Reserved" ); break;
		}
		printf( "\nPerformance move : " );
		switch( SD_status->PerformanceMove )
		{
		case 0x00: printf( "Sequential write" ); break;
		case 0xFF: printf( "Infinity" ); break;
		default: printf( "%d Mb/sec", SD_status->PerformanceMove ); break;
		}
		printf( "\nAllocation Unit size : " );
		switch( SD_status->AU_Size )
		{
		case 0x00: printf( "not defined" ); break;
		case 0x01: printf( "16 Kb" ); break;
		case 0x02: printf( "32 Kb" ); break;
		case 0x03: printf( "64 Kb" ); break;
		case 0x04: printf( "128 Kb" ); break;
		case 0x05: printf( "256 Kb" ); break;
		case 0x06: printf( "512 Kb" ); break;
		case 0x07: printf( "1 Mb" ); break;
		case 0x08: printf( "2 Mb" ); break;
		case 0x09: printf( "4 Mb" ); break;
		case 0x0A: printf( "8 Mb" ); break;
		case 0x0B: printf( "12 Mb" ); break;
		case 0x0C: printf( "16 Mb" ); break;
		case 0x0D: printf( "24 Mb" ); break;
		case 0x0E: printf( "32 Mb" ); break;
		case 0x0F: printf( "64 Mb" ); break;
		default: break;
		}
		printf( "\nErase Size : %d AU blocks\n", SD_status->EraseSize );
		printf( "Erase Timeout : %d seconds\n", SD_status->EraseTimeout );
		printf( "Erase Offset : %d seconds\n", SD_status->EraseOffset );
		printf( "Speed Grade for UHS mode : %s\n",
			( SD_status->UHS_SpeedGrade == 0 ) ? "< 10 Mb/sec" : "> 10 Mb/sec" );
		printf( "Allocation Unit size for UHS mode : " );
		switch( SD_status->UHS_AU_Size )
		{
		case 0x00: printf( "not defined" ); break;
		case 0x07: printf( "1 Mb" ); break;
		case 0x08: printf( "2 Mb" ); break;
		case 0x09: printf( "4 Mb" ); break;
		case 0x0A: printf( "8 Mb" ); break;
		case 0x0B: printf( "12 Mb" ); break;
		case 0x0C: printf( "16 Mb" ); break;
		case 0x0D: printf( "24 Mb" ); break;
		case 0x0E: printf( "32 Mb" ); break;
		case 0x0F: printf( "64 Mb" ); break;
		default:   printf( "not used" ); break;
		}
	}
	printf( "\n\nDONE\n" );
}

/**
 * @}
 *//* STM32_Public_Functions */


/**
 * @}
 *//* Utilities */
